Masmiseim36/nxpSDK/devices/MKW36Z4/drivers/fsl_flexcan.c
    assert(pTimingConfig->fphaseSeg2 <= MAX_FPSEG2);

    /* subtract one TQ for sync seg. */
    /* sjw is 20% of total TQ, rounded to nearest int. */
    pTimingConfig->frJumpwidth = ((uint8_t)tqNum + (5U - 1U)) / 5U - 1U;

    if (pTimingConfig->frJumpwidth > MAX_FRJW)
    {
        pTimingConfig->frJumpwidth = MAX_FRJW;
    }
}

/*!
 * @brief Calculates the improved timing values by specific baudrates for CANFD
 *
 * @param baudRate  The CANFD bus control speed in bps defined by user
 * @param baudRateFD  The CANFD bus data speed in bps defined by user
 * @param sourceClock_Hz The Source clock data speed in bps. Zero to disable baudrate switching
 * @param pTimingConfig Pointer to the FlexCAN timing configuration structure.
 *
 * @return TRUE if timing configuration found, FALSE if failed to find configuration
 */
bool FLEXCAN_FDCalculateImprovedTimingValues(uint32_t baudRate,
                                             uint32_t baudRateFD,
                                             uint32_t sourceClock_Hz,
                                             flexcan_timing_config_t *pTimingConfig)
{
    /* observe baud rate maximums */
    assert(baudRate <= MAX_CAN_BAUDRATE);
    assert(baudRateFD <= MAX_CANFD_BAUDRATE);

    uint32_t clk, clkbrs;
    uint32_t clk2, clkbrs2;
    uint32_t tqNum, tqNumbrs;                            /* Numbers of TQ. */
    bool fgCaculateCBT = false, fgCaculateFDCBT = false; /* default value false means to find solution fail. */

    /*  Auto Improved Protocal timing for CBT. */
    tqNum = CBT_MAX_TIME_QUANTA;
    do
    {
        clk = baudRate * tqNum;
        if (clk > sourceClock_Hz)
        {
            continue; /* tqNum too large, clk x tqNum has been exceed sourceClock_Hz. */
        }

        if (clk < sourceClock_Hz)
        {
            break; /*  Non-supporting: the frequency of clock source is not divisible by target baud rate, the user
                      should change a divisible baud rate. */
        }

        for (pTimingConfig->preDivider = 0x00; pTimingConfig->preDivider <= MAX_EPRESDIV; (pTimingConfig->preDivider)++)
        {
            /* Consider some proessor not contain FPU, the parameter need to be exact division. */
            if ((clk / ((uint32_t)(pTimingConfig->preDivider) + 1U) * ((uint32_t)(pTimingConfig->preDivider) + 1U)) !=
                clk)
            {
                continue; /* clk need to be exact division by preDivider + 1. */
            }
            clk2 = clk / ((uint32_t)(pTimingConfig->preDivider) + 1U);

            if ((sourceClock_Hz / clk2 * clk2) != sourceClock_Hz)
            {
                continue; /* sourceClock_Hz need to be exact division by clk2. */
            }
            /* Get the best CANFD conrol bus timing configuration. */
            FLEXCAN_FDGetSegments(baudRate, tqNum, pTimingConfig);
            fgCaculateCBT = true;
            break;
        }

        if (fgCaculateCBT)
        {
            break;
        }
    } while (--tqNum >= CBT_MIN_TIME_QUANTA);

    /* After calculate for CBT, continue to calculate FBCBT field timing configuration. */
    tqNumbrs = FDCBT_MAX_TIME_QUANTA;
    do
    {
        clkbrs = baudRateFD * tqNumbrs;
        if (clkbrs > sourceClock_Hz)
        {
            continue; /* tqNumbrs too large, clkbrs x tqNumbrs has been exceed sourceClock_Hz. */
        }

        if (clkbrs < sourceClock_Hz)
        {
            break; /*  Non-supporting: the frequency of clock source is not divisible by target baud rate, the user
                      should change a divisible baud rate. */
        }

        for (pTimingConfig->fpreDivider = 0x00; pTimingConfig->fpreDivider <= MAX_FPRESDIV;
             (pTimingConfig->fpreDivider)++)
        {
            /* Considering some proessor not contain FPU, the parameter need exact division. */
            if ((clkbrs / ((uint32_t)(pTimingConfig->fpreDivider) + 1U) *
                 ((uint32_t)(pTimingConfig->fpreDivider) + 1U)) != clkbrs)
            {
                continue; /* clk need to be exact division by preDivider + 1. */
            }
            clkbrs2 = clkbrs / ((uint32_t)(pTimingConfig->fpreDivider) + 1U);
            if ((sourceClock_Hz / clkbrs2 * clkbrs2) != sourceClock_Hz)
            {
                continue; /* sourceClock_Hz need to be exact division by preDivider. */
            }
            /* Get the best CANFD data bus timing configuration. */
            FLEXCAN_FDGetSegmentswithBRS(baudRateFD, tqNumbrs, pTimingConfig);
            fgCaculateFDCBT = true;
            break;
        }
        if (fgCaculateFDCBT)
        {
            break;
        }

    } while (--tqNumbrs >= FDCBT_MIN_TIME_QUANTA);

    return (fgCaculateCBT && fgCaculateFDCBT);
}
#endif

#if (defined(FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE) && FSL_FEATURE_FLEXCAN_HAS_FLEXIBLE_DATA_RATE)
void FLEXCAN_SetFDTxMbConfig(CAN_Type *base, uint8_t mbIdx, bool enable)
{
    /* Assertion. */
    assert(mbIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
    assert(!FLEXCAN_IsMbOccupied(base, mbIdx));
    uint8_t cnt = 0;
    uint8_t payload_dword = 1;
    uint32_t dataSize;
    dataSize = (base->FDCTRL & CAN_FDCTRL_MBDSR0_MASK) >> CAN_FDCTRL_MBDSR0_SHIFT;
    volatile uint32_t *mbAddr = &(base->MB[0].CS);
    uint32_t offset = FLEXCAN_GetFDMailboxOffset(base, mbIdx);
#if (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641)
    uint32_t availoffset = FLEXCAN_GetFDMailboxOffset(base, FLEXCAN_GetFirstValidMb(base));
#endif

    /* Inactivate Message Buffer. */
    if (enable)
    {
        /* Inactivate by writing CS. */
        mbAddr[offset] = CAN_CS_CODE(kFLEXCAN_TxMbInactive);
    }
    else
    {
        mbAddr[offset] = 0x0;
    }

    /* Calculate the DWORD number, dataSize 0/1/2/3 corresponds to 8/16/32/64
       Bytes payload. */
    for (cnt = 0; cnt < dataSize + 1; cnt++)
    {
        payload_dword *= 2;
    }

    /* Clean ID. */
    mbAddr[offset + 1] = 0x0;
    /* Clean Message Buffer content, DWORD by DWORD. */
    for (cnt = 0; cnt < payload_dword; cnt++)
    {
        mbAddr[offset + 2 + cnt] = 0x0;
    }

#if (defined(FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641) && FSL_FEATURE_FLEXCAN_HAS_ERRATA_5641)
    mbAddr[availoffset] = CAN_CS_CODE(kFLEXCAN_TxMbInactive);
#endif
}
#endif

void FLEXCAN_SetRxMbConfig(CAN_Type *base, uint8_t mbIdx, const flexcan_rx_mb_config_t *config, bool enable)
{
    /* Assertion. */
    assert(mbIdx <= (base->MCR & CAN_MCR_MAXMB_MASK));
    assert(((config) || (false == enable)));
    assert(!FLEXCAN_IsMbOccupied(base, mbIdx));

    uint32_t cs_temp = 0;

    /* Inactivate Message Buffer. */
    base->MB[mbIdx].CS = 0;

